export const tileColors = {
    0: "#cdc1b4",      // 空白格子的颜色
    2: "#eee4da",      // 2 的颜色
    4: "#ede0c8",      // 4 的颜色
    8: "#f2b179",      // 8 的颜色
    16: "#f59563",     // 16 的颜色
    32: "#f67c5f",     // 32 的颜色
    64: "#f65e3b",     // 64 的颜色
    128: "#edcf72",    // 128 的颜色
    256: "#edcc61",    // 256 的颜色
    512: "#edc850",    // 512 的颜色
    1024: "#edc53f",   // 1024 的颜色
    2048: "#edc22e",   // 2048 的颜色
    4096: "#eee4da",   // 4096 的颜色，较浅黄色
    8192: "#edc22e",   // 8192 的颜色，亮黄色
    16384: "#f2b179",  // 16384 的颜色，橙色
    32768: "#f67c5f",  // 32768 的颜色，红橙色
    65536: "#f65e3b",  // 65536 的颜色，深红色
    131072: "#3c3a32", // 131072 的颜色，深棕色（接近黑色）
  };